isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.h
////###########################################################################
// $TI Release: C2000 EtherCAT solutions support v1.00 $
// $Release Date: 07/2017 $
// $Copyright:
// Copyright (C) 2017 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################
#include "F28x_Project.h"
#include "F2837xD_spi.h"

#ifndef _ETHERCAT_SLAVE_C28x_HAL_H_
#define _ETHERCAT_SLAVE_C28x_HAL_H_

#ifdef __cplusplus
extern "C" {
#endif


extern uint16_t* pEsc; //pointer to the ESC memory

//
// extern function prototypes (defined in EtherCAT slave stack)
//
extern void Sync0_Isr(void);
extern void PDI_Isr(void);
extern void Sync1_Isr(void);

//
// HAL function prototypes
//

/***********************************************************************************
 * @fn      ESC_getTimer(void);
 * @brief   This function returns the current timer counter value from
 *          CPU Timer0. The C28x CPU Timer counter decrements from
 *          0xFFFFFFFF so a one鎶� complement of the current timer counter is
 *          returned to the caller
 *
 * @param   None
 *
 * @return  1鎶� complement of the current CPU TIMER0 counter value
 ***********************************************************************************/
extern uint32_t ESC_getTimer(void);


/***********************************************************************************
 * @fn          ESC_clearTimer(void);
 * @brief       This function clears the CPU Timer0 timer counter to 0x0.
 *              Customer could set it to 0xFFFFFFFF if needed
 *
 * @param       None
 *
 * @return      None
 ************************************************************************************/
extern void ESC_clearTimer(void);


/***********************************************************************************
 * @fn          ESC_timerIncPerMilliSec(void);
 * @brief       function returns timer increment per ms
 *
 * @param       None
 *
 * @return      constant value of no.of increments per ms as per CPU clock
 ************************************************************************************/
extern uint32_t ESC_timerIncPerMilliSec(void);


/*****************************************************************************************
 * @fn          ESC_readWordNonISR
 * @brief       This function returns the 16 bit data value at the address pointed
 *              by the offset parameter. This function disables the interrupts while
 *              data is read and enables the interrupts back after data is read.
 *              So the function cannot be called from inside another ISR
 *
 * @param
 *      uint16_t offset 锟� 16 bit location address that needs to be read
 *
 * @return      16 bit data at the address location offset.
*****************************************************************************************/
extern uint16_t ESC_readWordNonISR(uint16_t offset);


/*****************************************************************************************
 * @fn          ESC_readWordISR
 * @brief       This function returns the 16 bit data value at the address pointed
 *              by the offset parameter. This function doesn鎶� alter any interrupt masks.
 *              So this function can be called from within another ISR
 *
 * @param
 *      uint16_t offset 锟� 16 bit location address that needs to be read
 *
 * @return      16 bit data at the address location offset.
*****************************************************************************************/
extern uint16_t ESC_readWordISR(uint16_t offset);


/*****************************************************************************************
 * @fn          ESC_readDWordNonISR
 * @brief       This function returns 32 bits of data at the address pointed by the Address
 *              parameter. This function disables the interrupts while the block of data is
 *              read and enables the interrupts back after the data is read. So this function
 *              cannot be called from within another ISR
 *
 * @param
 *      uint16_t Address 锟� Address where data has to be read from the ESC
 *
 * @return      uint32_t - 32 bits data at the address location.
*****************************************************************************************/
extern uint32_t ESC_readDWordNonISR(uint16_t Address);


/*****************************************************************************************
 * @fn          ESC_readDWordISR
 * @brief       This function returns 32 bits of data at the address pointed by the Address
 *              parameter. This function doesn鎶� alter any interrupts while data is read.
 *              So this function can be called from within another ISR
 *
 * @param
 *      uint16_t Address 锟� Address where data has to be read from the ESC
 *
 * @return       uint32_t - 32 bits data at the address location.
*****************************************************************************************/
extern uint32_t ESC_readDWordISR(uint16_t Address);


/*****************************************************************************************
 * @fn          ESC_readBlockISR
 * @brief       This function returns block of data of number of bytes equal to length
 *              provided by Len parameter at the address pointed by the Address parameter.
 *              This function doesn鎶� alter any interrupt masks.
 *              So this function can be called from within another ISR
 *
 * @param
 *      uint16_t *pData 锟� Pointer to the destination array where the block of data will be copied
 *      uint16_t Address 锟� Address where data has to be read from the ESC
 *      uint16_t Len    锟� Length of data block in bytes
 *
 * @return       none
*****************************************************************************************/
extern void ESC_readBlockISR(uint16_t *pData,uint16_t Address,uint16_t Len);


/*****************************************************************************************
 * @fn          ESC_readBlockNonISR
 * @brief       This function returns block of data of number of bytes equal to length
 *              provided by Len parameter at the address pointed by the Address parameter.
 *              This function disables the interrupts while the block of data is read and
 *              enables the interrupts back after the data is read. So this function
 *              cannot be called from within another ISR
 * @param
 *      uint16_t *pData 锟� Pointer to the destination array where the block of data will be copied
 *      uint16_t Address 锟� Address where data has to be read from the ESC
 *      uint16_t Len    锟� Length of data block in bytes
 *
 * @return       none
*****************************************************************************************/
extern void ESC_readBlockNonISR(uint16_t *pData,uint16_t Address,uint16_t Len);


/*****************************************************************************************
 * @fn          ESC_writeWordNonISR
 * @brief       This function writes 32 bit of data to the address pointed by the Address
 *              parameter. This function disables the interrupts while the block of data
 *              is written to and enables the interrupts back after the data is written.
 *              So this function cannot be called from within another ISR.
 *
 * @param
 *      uint16_t DWordValue 锟� 16 bit data value that needs to be written to ESC
 *      uint16_t Address 锟� Address where data has to be written to in the ESC
 *
 * @return       none
*****************************************************************************************/
extern void ESC_writeWordNonISR(uint16_t WordValue, uint16_t Address);


/*****************************************************************************************
 * @fn          ESC_writeWordISR
 * @brief       This function writes 16 bit of data to the address pointed by the Address
 *              parameter. This function doesn鎶� alter any interrupt masks. So this
 *              function can be called from within another ISR
 *
 * @param
 *      uint16_t WordValue 锟� 16 bit data value that needs to be written to ESC
 *      uint16_t Address 锟� Address where data has to be written to in the ESC
 *
 * @return       none
*****************************************************************************************/
extern void ESC_writeWordISR(uint16_t WordValue, uint16_t Address);


/*****************************************************************************************
 * @fn          ESC_writeDWordNonISR
 * @brief       This function writes 32 bit of data to the address pointed by the Address
 *              parameter. This function disables the interrupts while the block of data
 *              is written to and enables the interrupts back after the data is written.
 *              So this function cannot be called from within another ISR.
 *
 * @param
 *      uint32_t DWordValue 锟� 32 bit data value that needs to be written to ESC
 *      uint16_t Address 锟� Address where data has to be written to in the ESC
 *
 * @return       none
*****************************************************************************************/
extern void ESC_writeDWordNonISR(uint32_t DWordValue, uint16_t Address);


/*****************************************************************************************
 * @fn          ESC_writeDWordISR
 * @brief       This function writes 32 bit of data to the address pointed by the Address
 *              parameter. This function doesn鎶� alter any interrupt masks. So this
 *              function can be called from within another ISR
 *
 * @param
 *      uint32_t DWordValue 锟� 32 bit data value that needs to be written to ESC
 *      uint16_t Address 锟� Address where data has to be written to in the ESC
 *
 * @return       none
*****************************************************************************************/
extern void ESC_writeDWordISR(uint32_t DWordValue, uint16_t Address);


/*****************************************************************************************
 * @fn          ESC_writeBlockISR
 * @brief       This function writes block of data of number of bytes equal to length
 *              provided by Len parameter at the address pointed by the Address parameter.
 *              This function doesn鎶� alter any interrupt masks. So this function can
 *              be called from within another ISR
 *
 * @param
 *      uint16_t *pData 锟� Pointer to the source array where the block of data needs be copied
 *                          from, to the destination address in ESC
 *      uint16_t Address 锟� Address where data has to be written to in the ESC
 *      uint16_t Len     锟� Length of data block in bytes
 *
 * @return       none
*****************************************************************************************/
extern void ESC_writeBlockISR(uint16_t *pData,uint16_t Address,uint16_t Len);


/*****************************************************************************************
 * @fn          ESC_writeBlockISR
 * @brief       This function writes block of data of number of bytes equal to length
 *              provided by Len parameter at the address pointed by the Address parameter.
 *              This function disables the interrupts while the block of data is written
 *              to and enables the interrupts back after the data is written.
 *              So this function cannot be called from within another ISR.
 * @param
 *      uint16_t *pData 锟� Pointer to the source array where the block of data needs be copied
 *                          from, to the destination address in ESC
 *      uint16_t Address 锟� Address where data has to be written to in the ESC
 *      uint16_t Len     锟� Length of data block in bytes
 *
 * @return       none
*****************************************************************************************/
extern void ESC_writeBlockNonISR(uint16_t *pData,uint16_t Address,uint16_t Len);


/*****************************************************************************************
* @fn           ESC_setupPDITestInterface
* @brief        This function is optional and available for applications or users to perform
*               a test of the PDI interface. The function reads the PDI control registers,
*               initializes an array of registers that needs to be read from ESC and also
*               performs read write tests on all of the RAM in ESC using the HAL API.
*
* @param    none
*
* @return       none

