isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.h
*****************************************************************************************/
extern void ESC_setupPDITestInterface(void);


/*****************************************************************************************
 * @fn          ESC_InitHW
 * @brief       This function is the main function that initializes the F32837xD MCU for
 *              EtherCAT examples. This function initializes system PLL, configures PIE,
 *              configures GPIO, EMIF or SPI depending on the build option chosen.
 *              This function also resets the ET1100 using the RESET GPIO and checks for
 *              EEPROM LOADED signal to go active.
 *
 * @param        none
 *
 * @return       none
*****************************************************************************************/
extern void ESC_initHW(void);

/*****************************************************************************************
 * @fn          setup_emif2_pinmux_async_16bit
 * @brief       This function initializes EMIF2 interface of the MCU for PDI functionality
 *
 * @param
 *  uint16_t cpu_sel : 1 for CPU1 and this function is only supported for CPU1 for now.
 *
 * @return       none
*****************************************************************************************/
extern void setup_emif2_pinmux_async_16bit(uint16_t cpu_sel); // EMIF driver call


/*****************************************************************************************
 * @fn          setup_emif1_pinmux_async_16bit_option2
 * @brief       This function initializes EMIF2 interface of the MCU for PDI functionality
 *
 * @param
 *  uint16_t cpu_sel : 1 for CPU1 and this function is only supported for CPU1 for now.
 *
 * @return       none
*****************************************************************************************/
extern void setup_emif1_pinmux_async_16bit_option2(uint16_t cpu_sel); // EMIF driver call


/*****************************************************************************************
 * @fn          ESC_signalPass
 * @brief       This function is internal to the HAL and can be used for debug.
 *              The function toggles a GPIO when a test or step completes successfully.
 *
 * @param       none
 *
 * @return       none
*****************************************************************************************/
extern void ESC_signalPass(void);


/*****************************************************************************************
 * @fn          ESC_signalFail
 * @brief       This function is internal to the HAL and can be used for debug.
 *              The function toggles a GPIO when a test or step completes in failure.
 *
 * @param       none
 *
 * @return       none
*****************************************************************************************/
extern void ESC_signalFail(void);


/*****************************************************************************************
 * @fn          ESC_passFailSignalSetup
 * @brief       This function is internal to the HAL and sets up the GPIO that can be
 *              toggled for a PASS/FAIL condition
 *
 * @param       none
 *
 * @return       none
*****************************************************************************************/
extern void ESC_passFailSignalSetup(void);


/*****************************************************************************************
 * @fn          ESC_ET1100EEPROMLoadedCheck
 * @brief       This function can be called to check if the EEPROM loaded signal is
 *              active after a reset before accessing PDI interface from MCU.
 *
 * @param       none
 *
 * @return       uint16_t
 *                        returns 0 if EEPROM LOADED signal is not active after 5s
 *                        returns 1 if EEPROM LOADED signal is active
*****************************************************************************************/
extern uint16_t  ESC_ET1100EEPROMLoadedCheck(void);


/*****************************************************************************************
 * @fn          ESC_resetET1100
 * @brief       This function can be called to toggle reset signal of ET1100 by the MCU.
 *              the reset signal is pulled low for 500mS before it is pulled HIGH again
 *
 * @param       none
 *
 * @return      none
*****************************************************************************************/
extern void ESC_resetET1100(void);


/*****************************************************************************************
 * @fn          ESC_HoldET1100InReset
 * @brief       This function can be called keep the reset signal to ET1100 LOW,
 *              holding the ESC in reset from MCU.
 *
 * @param       none
 *
 * @return       none
*****************************************************************************************/
extern void ESC_holdET1100InReset(void);


/*****************************************************************************************
 * @fn          ESC_ReleaseET1100reset
 * @brief       This function can be called deactivate the reset signal to ET1100
 *              being ET1100 out of reset
 *
 * @param       none
 *
 * @return      none
*****************************************************************************************/
extern void ESC_releaseET1100Reset(void);


/*****************************************************************************************
 * @fn          ESC_ConfigureSync0GPIO
 * @brief       This function can be to initialize the GPIO used for SYNC0 signal
 *
 * @param       none
 *
 * @return       none
*****************************************************************************************/
extern void ESC_configureSync0GPIO(void);


/*****************************************************************************************
 * @fn          ESC_ConfigureSync1GPIO
 * @brief       This function can be to initialize the GPIO used for SYNC1 signal
 *
 * @param       none
 *
 * @return       none
*****************************************************************************************/
extern void ESC_configureSync1GPIO(void);


#ifdef PDI_HAL_TEST

/*****************************************************************************************
 * @fn           ESC_debugUpdateESCRegLogs
 * @brief        This function optional and loads the set of registers initialized by the
 *               function ESC_setupPDITestInterface() using PDI interface.
 *
 * @param       none
 *
 * @return      none
*****************************************************************************************/
extern void ESC_debugUpdateESCRegLogs(void);


/*****************************************************************************************
 * @fn          ESC_debugAddESCRegLogs
 * @brief       This function optional and adds a register to the array that can be read
 *              using the function ESC_debug_UpdateESCRegLogs()., loads the set of
 *              registers initialized by the function ESC_setupPDITestInterface()
 *              using PDI interface.
 *
 * @param
 *      uint16_t Address 锟� address of the register that needs to be logged
 *
 * @return       none
*****************************************************************************************/
extern void ESC_debugAddESCRegsAddress(uint16_t address);


/*****************************************************************************************
 * @fn          ESC_ debugInitESCRegLogs
 * @brief       This function optional and initializes the registers read log array to default
 *              0xFFFF
 *
 * @param    none
 *
 * @return       none
*****************************************************************************************/
extern void ESC_debugInitESCRegLogs(void);

//
//typedef
//

// data type to log ET1100 registers for PDI HAL TEST
typedef struct esc_et1100_regs
{
    uint16_t address;
    uint16_t data;
}esc_et1100_regs_t;

#endif  //PDI_HAL_TEST


