isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.h
/*
 * Board Configurations available
 *
 *
 * F2837x Control CARD Interface to ET1100 (PDI access definition):
 *          - EMIF1 (connections sample provided) - not supported in TMDSECATCNCD379D kit
 *          - EMIF2 Ethercat daughter card connected to Control card using HighRose connecter
 *          - SPIC  Ethercat daughter card connected to Control card using HighRose connecter
 *
 * F2837x Dual Core Launch Pad Interface to ET1100 (PDI access definition):
 *          - EMIF1 EtherCAT booster pack connected to launch pad using HighRose Connector
 *
 * $$$$$$$$$NOTE TO USER $$$$$$$$
 * ONLY LAUNCHXL REV2.0 is supported
 * To enable usage of EMIF1 with LaunchPad, user needs to enable USE_EMIF1 define as below
 *    - select build config _1_F2837xD_CCARD_EMIF_FLASH or _2_F2837xD_CCARD_EMIF_RAM
 *    - uncomment below macro for USE_EMIF1
 *    - rebuild the project.
 *    Now user should be able to connect the ET1100 daughter card to high rose connector J9
 *    on the Dual core LaunchPAD (LAUNCHPAD XL Rev2.0 for F28379D)
 */

// the below define is moved to F2837xD_device.h because of PLL dependency
//#define USE_EMIF1     //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100

#ifdef CONTROLCARD  //for Controlcard definitions

    #ifdef INTERFACE_SPI
#ifdef USE_EMIF1
    #error "user cannot use EMIF1 with SPI Configurations of project"
#endif
        extern void ESC_initSPI(void);
        extern void ESC_readSPI(uint16_t offset_addr,uint16_t numbytes, uint16_t* buffer);
        extern void ESC_writeSPI(uint16_t offset_addr,uint16_t *wrdata, uint16_t numwords) ;
#ifdef  USE_SPIA
        #define ESC_SPI_INT_GPIO           22
#endif
#ifdef  USE_SPIB
        #define ESC_SPI_INT_GPIO           52
#endif
        //on ET1100 it is 8KB of RAM
//      #define ESC_PDI_RAM_START_ADDRESS_OFFSET    0x1000
//      #define ESC_PDI_RAM_END_ADDRESS_OFFSET      0x2FFF

        //on ET1200 it is 1KB of RAM
        #define ESC_PDI_RAM_START_ADDRESS_OFFSET    0x1000
        #define ESC_PDI_RAM_END_ADDRESS_OFFSET      0x13FF
#ifdef USE_SPIA
        #define ESC_SYNC0_GPIO              19
        #define ESC_SYNC1_GPIO              19
        #define ESC_RESET_ET1100_GPIO       122
        #define ESC_EEPROM_LOADED_GPIO      4
#endif

#ifdef  USE_SPIB
     #define ESC_SYNC0_GPIO              139
     #define ESC_SYNC1_GPIO              139
     #define ESC_RESET_ET1100_GPIO       122
     #define ESC_EEPROM_LOADED_GPIO      10
#endif
    #else //#ifdef INTERFACE_SPI

        extern void setup_emif1_pinmux_async_16bit(Uint16 cpu_sel);
        extern void ESC_EMIF2SetupPinmuxAsync16Bit(Uint16 cpu_sel);
        extern void ESC_writeBlockEMIF2(uint16_t* pData, uint16_t offset_addr,uint16_t numwords);

        #ifdef USE_EMIF1 //LaunchPAD XL EMIF1 J9 connector option
            //on ET1100 it is 8KB of RAM
            #define ESC_PDI_RAM_START_ADDRESS_OFFSET    0x1000
            #define ESC_PDI_RAM_END_ADDRESS_OFFSET      0x1FFF
            #define ESC_EMIF_INT_GPIO                   107
            #define ESC_SYNC0_GPIO                      86
            #define ESC_SYNC1_GPIO                      87
            #define ESC_RESET_ET1100_GPIO               108
            #define ESC_EEPROM_LOADED_GPIO              52  //this was 33 on LAUNCXL Rev1.1

        #else // #ifdef ESC_USE_EMIF1   //USE EMIF2
            #define ESC_EMIF_INT_GPIO   136
            //with EMIF2 we can access 4KW = 8KB = 0x1000 address locations

            //0x0 to 0x1000 of ET1100 will be 0x2000[0] to 0x2000[0x800] of EMIF2 address sapce
            //0x1000 to 0x2000 of ET1100 will be 0x2000[0x800] to 0x2000[0x1000] of EMIF2 address space
            #define ESC_PDI_RAM_START_ADDRESS_OFFSET    0x1000
            #define ESC_PDI_RAM_END_ADDRESS_OFFSET      0x1FFF
            #define ESC_SYNC0_GPIO              113
            #define ESC_SYNC1_GPIO              114
            #define ESC_RESET_ET1100_GPIO       137
            #define ESC_EEPROM_LOADED_GPIO      119

        #endif //// #ifdef USE_EMIF1

#endif //#ifdef INTERFACE_SPI

#endif  //#ifdef CONTROLCARD


#define ESC_ETHERCAT_READ           0b010
#define ESC_ETHERCAT_READ_WAIT      0b011
#define ESC_ETHERCAT_WRITE          0b100
#define ESC_ETHERCAT_3BYTEADDR      0b110
#define ESC_ETHERCAT_WAIT           0xFF
#define ESC_ETHERCAT_CONTINUE       0x00
#define ESC_ETHERCAT_RDTERMINATE    0xFF

#define ESC_DEBUG_REGS_LENGTH   20

#ifdef __cplusplus
}
#endif /* extern "C" */


#endif // _ETHERCAT_SLAVE_C28x_HAL_H_
